w b e перпрыгнуть слово
W B E перпрыгнуть слово не считать скобки и кавычки

$ конец строки
0 начало строки

^ первый непробельный символ

gg начало файлa
G конец файла


A текст в начало 
I текаст в конец

o  добавляет текст в строчку под курсором
O  добавляет текст в строчку над курсором

d delit

d w удалить слово

d j удалить строку

d $ удалить до курсрора от конца строки

x удалить в курсор

X удалить  обратно


c w удалить слово

c j удалить строку

c $ удалить до курсрора от конца строки
D   удалить до курсрора от конца строки

V выделять строки

y cp

p paste


di удалить в ковычках ""

fx — переместить курсор на первый символ x next ;

% парные скобки

* прыгать по одинаковым словам

tn прыгать по одинаковым словам

метка создать m символ  вернутся `символ

zz вровнять файл
перети в файл gf



Vu	Перевести строку в нижний регистр
VU	Перевести строку в верхний регистр

vU v~	Перевести слово под курсором в верхний регистр
