w b e перпрыгнуть слово
W B E перпрыгнуть слово не считать скобки

$ конец строки
0 начало строки

^ первый непробельный символ

gg начало файлa
G конец файла


A текст в начало 
I текаст в конец

o  добавляет текст в строчку под курсором
O  добавляет текст в строчку над курсором

d delit

d w удалить слово

d j удалить строку

d $ удалить до курсрора от конца строки

x удалить в курсор

X удалить  обратно


c w удалить слово

c j удалить строку

c $ удалить до курсрора от конца строки

V выделять строки

y cp

p paste